Dlubal.RFEM5.ICalculation
Interface for working with calculation

Dlubal.RFEM5.ICalculation.GetSettings
Gets calculation settings.
Returns: Calculation settings

Dlubal.RFEM5.ICalculation.SetSettings(System.UInt32@)
Sets calculation settings.
Settings: Calculation settings

Dlubal.RFEM5.ICalculation.GetOptions
Gets calculation options.
Returns: Calculation options

Dlubal.RFEM5.ICalculation.SetOptions(System.UInt32@)
Sets calculation options.
Options: Calculation options

Dlubal.RFEM5.ICalculation.GetPrecisionAndTolerance
Gets precision and tolerance.
Returns: Calculation options

Dlubal.RFEM5.ICalculation.SetPrecisionAndTolerance(System.UInt32@)
Sets precision and tolerance.
Parameters: Precision and tolerance parameters

Dlubal.RFEM5.ICalculation.GetNonlinearities
Gets calculation nonlinearity parameters.
Returns: Nonlinearity parameters

Dlubal.RFEM5.ICalculation.SetNonlinearities(System.UInt32@)
Sets calculation nonlinearity parameters.
Parameters: Nonlinearity parameters

Dlubal.RFEM5.ICalculation.GetReactivation
Gets reactivation of failing members.
Returns: Parameters of reactivation of failing members

Dlubal.RFEM5.ICalculation.SetReactivation(System.UInt32@)
Sets reactivation of failing members.
Parameters: Parameters of reactivation of failing members

Dlubal.RFEM5.ICalculation.GetInternalPressure
Gets internal pressure parameters.
Returns: Parameters of internal pressure

Dlubal.RFEM5.ICalculation.SetInternalPressure(System.UInt32@)
Sets internal pressure parameters.
Parameters: Parameters of internal pressure

Dlubal.RFEM5.ICalculation.GetSolverMethod
Gets method for system of equations.
Returns: Solver method

Dlubal.RFEM5.ICalculation.SetSolverMethod(System.UInt32)
Sets method for system of equations.
Method: Solver method

Dlubal.RFEM5.ICalculation.GetBendingTheory
Gets plane bending theory.
Returns: Solver version

Dlubal.RFEM5.ICalculation.SetBendingTheory(System.UInt32)
Sets solver version.
Theory: Solver version

Dlubal.RFEM5.ICalculation.GetSolverVersion
Gets solver version.
Returns: Solver version

Dlubal.RFEM5.ICalculation.SetSolverVersion(System.UInt32)
Sets solver version.
Solver: Solver version

Dlubal.RFEM5.ICalculation.GenerateFeMesh
Generates FE mesh.

Dlubal.RFEM5.ICalculation.DeleteFeMesh
Deletes FE mesh.

Dlubal.RFEM5.ICalculation.GetFeMesh
Gets interface for working with FE mesh.
Returns: FE mesh interface

Dlubal.RFEM5.ICalculation.GetFeMeshSettings
Gets interface for working with FE mesh settings.
Returns: FE mesh interface

Dlubal.RFEM5.ICalculation.Calculate(System.UInt32,System.Int32)
Calculates results of selected load and returns list of errors occurred during the calculation.
Returns: Array of errors that occurred during the calculation.
Type: Loading type
No: Loading number

Dlubal.RFEM5.ICalculation.CalculateAll
Calculates results of all loads and modules and returns list of errors occurred during the calculation.
Returns: Array of errors that occurred during the calculation.

Dlubal.RFEM5.ICalculation.CalculateApp
Calculates results of the main application without modules and returns list of errors occurred during the calculation.
Returns: Array of errors that occurred during the calculation.

Dlubal.RFEM5.ICalculation.CalculateModules
Calculates results of all modules and returns list of errors occurred during the calculation.
Returns: Array of errors that occurred during the calculation.

Dlubal.RFEM5.ICalculation.CalculateBatch(System.UInt32@)
Calculates results of selected loadings and returns list of errors occurred during the calculation.
Returns: Array of errors that occurred during the calculation.
Loadings: Array of loadings

Dlubal.RFEM5.ICalculation.CalculateAsync(System.UInt32,System.Int32)
Asynchronous start of the calculation for selected load.
Type: Loading type
No: Loading number

Dlubal.RFEM5.ICalculation.CalculateAsyncAll
Asynchronous start of the application and all modules calculation.

Dlubal.RFEM5.ICalculation.CalculateAsyncApp
Asynchronous start of the application calculation. Modules are not calculated.

Dlubal.RFEM5.ICalculation.CalculateAsyncModules
Starts calculation of all modules. End of calculation is indicated by calling event function rsCalculatationFinished.

Dlubal.RFEM5.ICalculation.CalculateAsyncBatch(System.UInt32@)
Calculates results of selected loadings and returns list of errors occurred during the calculation.
Loadings: Array of loadings

Dlubal.RFEM5.ICalculation.GetResultsInRasterPoints(System.UInt32,System.Int32)
Gets results interface of specified loading. Results are in grid points.
Returns: Results interface
Type: Loading type
No: Loading number

Dlubal.RFEM5.ICalculation.GetResultsInFeNodes(System.UInt32,System.Int32)
Gets results interface of specified loading. Results are in FE mesh nodes
Returns: Results interface
Type: Loading type
No: Loading number

Dlubal.RFEM5.ICalculation.Clean
Deletes all results.

Dlubal.RFEM5.ICalculation.ExportIsolines
Gets interface for working with isolines.
Returns: Isolines export interface

Dlubal.RFEM5.ICalculation.GetSubCombinations
Gets interface for working with sub-combinations.
Returns: Sub-combinations interface